/*
试题编号：	201612-2
试题名称：	工资计算
时间限制：	1.0s
内存限制：	256.0MB
问题描述：	

　　小明的公司每个月给小明发工资，而小明拿到的工资为交完个人所得税之后的工资。假设他一个月的税前工资（扣除五险一金后、
    未扣税前的工资）为S元，则他应交的个人所得税按如下公式计算：
　　1） 个人所得税起征点为3500元，若S不超过3500，则不交税，3500元以上的部分才计算个人所得税，令A=S-3500元；
　　2） A中不超过1500元的部分，税率3%；
　　3） A中超过1500元未超过4500元的部分，税率10%；
　　4） A中超过4500元未超过9000元的部分，税率20%；
　　5） A中超过9000元未超过35000元的部分，税率25%；
　　6） A中超过35000元未超过55000元的部分，税率30%；
　　7） A中超过55000元未超过80000元的部分，税率35%；
　　8） A中超过80000元的部分，税率45%；
　　例如，如果小明的税前工资为10000元，则A=10000-3500=6500元，其中不超过1500元部分应缴税1500×3%=45元，超过1500元不
    超过4500元部分应缴税(4500-1500)×10%=300元，超过4500元部分应缴税(6500-4500)×20%=400元。总共缴税745元，税后所得
    为9255元。已知小明这个月税后所得为T元，请问他的税前工资S是多少元。
输入格式
　　输入的第一行包含一个整数T，表示小明的税后所得。所有评测数据保证小明的税前工资为一个整百的数。
输出格式
　　输出一个整数S，表示小明的税前工资。
样例输入
9255

样例输出
10000

评测用例规模与约定
　　对于所有评测用例，1 ≤ T ≤ 100000。

解题思路:
题目相当于给定了一个分段函数的第一个区间的左端点,每一段区间的取值范围和斜率,
可以以此求出每个区间的右端点坐标.
题目输入相当于分段函数的纵坐标, 要根据这个分段函数求出横坐标的值
函数图像可以参考p1.png

*/


#include<iostream>
#include<cstdio>
using namespace std;

//税前工资区间, 不同区间中的税率不同, 是一个分段函数
int range[] = {3500, 3500+1500, 3500+4500, 3500+9000, 3500+35000, 3500+55000, 3500+80000, 1000000};
int afterTax[10]={3500}; //保存各个区间的税后工资的右端点

double rate[] = {1, 0.97, 0.9, 0.8, 0.75, 0.7, 0.65, 0.55};

int main()
{
    #ifdef WFX
    freopen("in.txt", "r", stdin);
    #endif
    int T, k;
    scanf("%d",&T);

    //计算税后区间的右端点 = 前一个期间的右端点 + (区间长度) * 本区间税率
    for(int i=1; i<8; ++i) afterTax[i] = afterTax[i-1] + (range[i] - range[i-1]) * rate[i];
    for(k=0; afterTax[k] < T; ++k); //找到给定税后工资所属的区间
	
    //y = kx + b ==>
    //税前工资 = 前一个区间税前工资的右端点 + 横坐标长度/斜率
	int res = range[k] + (T - afterTax[k])/rate[k]; 
    printf("%d\n",res);
	
    return 0;
}
