/*
试题编号：	201709-1
试题名称：	打酱油
时间限制：	1.0s
内存限制：	256.0MB
问题描述：
　　小明带着N元钱去买酱油。酱油10块钱一瓶，商家进行促销，每买3瓶送1瓶，或者每买5瓶送2瓶。请问小明最多可以得到多少瓶酱油。
输入格式
　　输入的第一行包含一个整数N，表示小明可用于买酱油的钱数。N是10的整数倍，N不超过300。
输出格式
　　输出一个整数，表示小明最多可以得到多少瓶酱油。
样例输入
40
样例输出
5
样例说明
　　把40元分成30元和10元，分别买3瓶和1瓶，其中3瓶送1瓶，共得到5瓶。
样例输入
80
样例输出
11
样例说明
　　把80元分成30元和50元，分别买3瓶和5瓶，其中3瓶送1瓶，5瓶送2瓶，共得到11瓶。


解题思路:


*/

#include<iostream>
#include<cstdio>
#include<algorithm>
using namespace std;


int main()
{
    #ifdef WFX
    freopen("in.txt","r",stdin);
    #endif
    int N;
    scanf("%d",&N);
    N /= 10;
    int i = N / 5;          //买5送2的最大次数
    int j = (N-i*5)/3;      //买3送1的最大次数
    int k = N - i * 5 - j * 3; //剩下的钱单买
    int ans = i*7 + j * 4 + k;  //总数
    
    printf("%d\n", ans);

    return 0;  
}